Revit 2024 API
MEPSpaceConstruction.NewConstruction Method
Create a new construction for Space constructions.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public MEPBuildingConstruction NewConstruction(
	string pName
)
Visual Basic
Public Function NewConstruction ( _
	pName As String _
) As MEPBuildingConstruction
Visual C++
public:
MEPBuildingConstruction^ NewConstruction(
	String^ pName
)
Parameters
pName
Type: System.String
The name of the new Construction.
Remarks
If the name is same as an existing one, an exception will be thrown.
See Also
MEPSpaceConstruction Class
Autodesk.Revit.DB.Mechanical Namespace